Feature: Писане на оценка на ученик

Background:
    Given Преподавателят отваря екрана за писане на нова оценка

  Scenario Outline: Писане на оценка
    When Избира клас: "<class>"
    And Избира ученик: "<student>"
    And Избира предмет: "<subject>"
    And Избира оценка: "<grade>"
    And Натиска бутона за добавяне на оценката
    Then Получава съобщение: "<expectedMessage>"
    
	Examples: 
	  |class|student                 |subject   |grade|expectedMessage                                                       |
	  |1-А  |Стефан Иванов Стоянов   |Математика|5    |Оценката е добавена успешно!                                          |
	  |1-А  |Стефан Иванов Стоянов   |Математика|8    |Избраната оценка е невалидна!                                         |
	  |1-А  |Гсгфс Ффгсг Ггсгс       |Математика|4    |Ученикът, който сте избрали не съществува! Моля, опреснете страницата!|
	  |1-А  |Кристиян Христов Борисов|Математика|6    |Несъвместимост между клас и ученик!                                   |
	  |1-А  |Стефан Иванов Стоянов   |География |2    |Несъвместимост между клас и предмет!                                  |
