Feature: Порверка на оценките на дете от родител

  Scenario Outline: Проверка на оценки
  	Given Родителят "<Pfname>" "<Plname>" "<Phone>", отваря екрана за проверка на оценки
    When Избира дете: "<student>"
    And Избира предмет: "<subject>"
    And Избира оценка: "<grade>"
    And Натиска бутона за търсене
    Then Получава съобщение: "<expectedMessage>"
    
	Examples: 
		|Pfname |Plname  |Phone     |student                     |subject   |grade|expectedMessage                                               |
    |Йордан |Стоянов |0888777521|Стефан Иванов Стоянов       |Математика|5    |Открити оценки!                                               |
	  |Йордан |Стоянов |0888777521|Стефан Иванов Стоянов       |Математика|     |Открити оценки!                                               |
	  |Марияна|Стоянова|0888777522|Стефан Иванов Стоянов       |          |     |Открити оценки!                                               |
	  |Йордан |Стоянов |0888777521|Стефан Иванов Стоянов       |          |6    |Няма открити оценки!                                          |
	  |       |        |          |                            |Математика|5    |Проблем при оторизацията ви! Моля, влезте отново в акаунта си!|
	  |Йордан |Стоянов |0888777521|Маргарита Иванова Пенчева   |          |     |Нямате достъп до оценките на този ученик!                     |
